Repository: NMarjou/localization-app
Catalog: TMs/en-US_de-DE.tmx
Source language: en_us
Languages: de_de

source: Rating label
de_de: Bewertungsbezeichnung

source: Read by worker
de_de: Gelesen von Mitarbeiter:in

source: Read date
de_de: Lesedatum

source: Read flag
de_de: Lesekennzeichen

source: # Read
de_de: # Gelesen

source: % Read
de_de: % Gelesen

source: # Received behaviors request
de_de: # Erhaltene Verhaltensanforderungen

source: # Received feedback
de_de: # Erhaltenes Feedback

source: # Received requests
de_de: # Erhaltene Anfragen

source: % Recurrent check-ins
de_de: % Wiederkehrende Check-ins

source: Release date
de_de: Freigabedatum

source: % Release
de_de: % Freigabe

source: # Released
de_de: # Freigegeben

source: Remaining days to respond
de_de: Verbleibende Tage zur Antwort

source: # Replied request
de_de: # Beantwortete Anfragen

source: % Reply rate
de_de: % Antwortquote

source: Request creation date
de_de: Antrags­erstellungsdatum

source: Request ID
de_de: Anfrage-ID

source: % Request read
de_de: % Gelesene Anfragen

source: Request reply rate
de_de: Antwortquote auf Anfragen

source: Request status
de_de: Antragsstatus

source: # Requests to manager
de_de: # Anfragen an Manager

source: # Requests to worker
de_de: # Anfragen an Mitarbeiter:innen

source: Request UID
de_de: Anfrage-UID

source: Requested behavior
de_de: Angefordertes Verhalten

source: Requested behaviors
de_de: Angeforderte Verhaltensweisen

source: % Requested feedback
de_de: % Angefordertes Feedback

source: Requested/unsolicited
de_de: Angefordert/unaufgefordert

source: Requests replied
de_de: Beantwortete Anfragen

source: % Requests with behaviors
de_de: % Anfragen mit Verhaltensbezug

source: Review created date
de_de: Erstellungsdatum der Beurteilung

source: Review ID
de_de: Beurteilungs-ID

source: Review manager ID
de_de: Beurteilungsmanager-ID

source: Review manager name
de_de: Name des Beurteilungsmanagers

source: Review name
de_de: Beurteilungsname

source: Review rating
de_de: Beurteilungsbewertung

source: Template name
de_de: Vorlagenname

source: Review UUID
de_de: Beurteilungs-UUID

source: Reviews challenged
de_de: Angefochtene Beurteilungen

source: % Reviews
de_de: % Beurteilungen

source: Role
de_de: Rolle

source: %RT count of sent behavior
de_de: %RT-Anzahl gesendeter Verhaltensweisen

source: # RTI requests
de_de: # RTI-Anfragen

source: scale
de_de: Skala

source: Scale name
de_de: Skalenname

source: % Score vs max.
de_de: % Punktzahl vs. Maximum

source: % Score vs max. score
de_de: % Punktzahl vs. Maximalpunktzahl

source: Secondary communication manager ID
de_de: Sekundäre Kommunikationsmanager-ID

source: Secondary communication manager name
de_de: Sekundärer Kommunikationsmanagername

source: Secondary hierarchy name
de_de: Sekundärer Hierarchiename

source: Section score
de_de: Abschnittspunktzahl

source: # Sent behaviors
de_de: # Gesendete Verhaltensweisen

source: Sent behaviors
de_de: Gesendete Verhaltensweisen

source: # Sent feedback
de_de: # Gesendetes Feedback

source: % Shared feedback
de_de: % Geteiltes Feedback

source: % Shared goals
de_de: % Geteilte Ziele

source: Sign off date time
de_de: Datum und Uhrzeit der Bestätigung

source: Signed off
de_de: Bestätigt

source: Start date in company
de_de: Eintrittsdatum im Unternehmen

source: Succeeded
de_de: Erfolgreich

source: Tag name value
de_de: Tag-Namenwert

source: # Thanks
de_de: # Danke

source: # Times overridden
de_de: # Anzahl der Überschreibungen

source: # Times read
de_de: # Anzahl der Lesungen

source: # Times released
de_de: # Anzahl der Freigaben

source: # Times unreleased
de_de: # Anzahl der Aufhebungen der Freigabe

source: (to be deleted) % Connections all
de_de: (wird gelöscht) % Verbindungen alle

source: To worker ID
de_de: An Mitarbeiter:in-ID

source: Total behaviors
de_de: Gesamtanzahl Verhaltensweisen

source: Total feedback requested
de_de: Insgesamt angefordertes Feedback

source: Total feedback requests
de_de: Feedback-Gesamtanfragen

source: Total feedback sent
de_de: Insgesamt gesendetes Feedback

source: Total goals
de_de: Gesamtziele

source: % Total
de_de: % Gesamt

source: Total performance check-ins
de_de: Gesamtanzahl Leistungs-Check-ins

source: Total reviews
de_de: Gesamtanzahl der Beurteilungen

source: Total reviews with behavior rating
de_de: Gesamtanzahl der Beurteilungen mit Verhaltensbewertung

source: Total reviews with goal ratings
de_de: Gesamtanzahl der Beurteilungen mit Zielbewertungen

source: Total score
de_de: Gesamtpunktzahl

source: Tracking status
de_de: Verfolgungsstatus

source: Trust
de_de: Vertrauen

source: Unclear
de_de: Unklar

source: # Unclear
de_de: # Unklar

source: Unhelpful
de_de: Nicht hilfreich

source: # Unique aligned goals
de_de: # Eindeutige ausgerichtete Ziele

source: Unique feedback identifier
de_de: Eindeutige Feedback-Kennung

source: # Unique logins
de_de: # Eindeutige Anmeldungen

source: # Unique main goals
de_de: # Eindeutige Hauptziele

source: Unique worker ID
de_de: Eindeutige Mitarbeiter:innen-ID

source: % Unreleased
de_de: % Nicht veröffentlicht

source: Unreleased flag
de_de: Nicht freigegebenes Kennzeichen

source: # Unreleased
de_de: # Nicht veröffentlicht

source: # User plans
de_de: # Benutzerpläne

source: User status
de_de: Benutzerstatus

source: % Users having aligned goals
de_de: % Benutzer mit ausgerichteten Zielen

source: % Users having behaviors
de_de: % Benutzer mit Verhaltensweisen

source: # Users having check-ins
de_de: # Benutzer mit Check-ins

source: % Used check-ins
de_de: % genutzte Check-ins

source: # Users having goals
de_de: # Benutzer mit Zielen

source: % Used goals
de_de: % verwendete Ziele

source: # Users having no goals
de_de: # Benutzer ohne Ziele

source: % Users having no goals
de_de: % Benutzer ohne Ziele

source: # Users having plans
de_de: # Benutzer mit Plänen

source: % Users having plans
de_de: % Benutzer mit Plänen

source: # Users logged in
de_de: # Angemeldete Benutzer

source: % Users logged in
de_de: % angemeldete Benutzer

source: % Users received feedback
de_de: % Benutzer mit erhaltenem Feedback

source: # Users received feedback ratings
de_de: # Benutzer mit erhaltenen Feedbackbewertungen

source: # Users requested feedback
de_de: # Benutzer mit angefordertem Feedback

source: % Users requested feedback
de_de: % Benutzer mit angefordertem Feedback

source: # Users used feedback
de_de: # Nutzer nutzten Feedback

source: % Used feedback
de_de: % genutztes Feedback

source: # Users who sent feedback
de_de: # Benutzer, die Feedback gesendet haben

source: % Users who sent feedback
de_de: % Benutzer, die Feedback gesendet haben

source: # Warning
de_de: # Warnung

source: % Warning
de_de: % Warnung

source: Weighted score
de_de: Gewichtete Punktzahl

source: Work country
de_de: Arbeitsland

source: Work region
de_de: Arbeitsregion

source: Work region state
de_de: Arbeitsregion – Bundesstaat

source: Work town city
de_de: Arbeitsstadt

source: Worker behavior comment
de_de: Kommentar zum Verhalten der Mitarbeiter:in

source: Worker behavior rating name
de_de: Name der Verhaltensbewertung der Mitarbeiter:in

source: Worker challenge is submitted
de_de: Einspruch der/des Mitarbeiter:in ist eingereicht

source: Worker email
de_de: E-Mail des/der Mitarbeiter:in

source: Worker evaluation
de_de: Mitarbeiter:innenbeurteilung

source: Worker final review status
de_de: Endgültiger Beurteilungsstatus der/des Mitarbeiter:in

source: Worker full name
de_de: Vollständiger Name der Mitarbeiter:in

source: Worker ID and name
de_de: Mitarbeiter:in-ID und Name

source: Worker ID + full name
de_de: Mitarbeiter:innen-ID + vollständiger Name

source: % Workers logged in
de_de: % Mitarbeiter:innen angemeldet

source: Worker rating
de_de: Mitarbeiter:innenbewertung

source: Worker rating comment
de_de: Kommentar zur Mitarbeiter:innenbewertung

source: Worker refused plan
de_de: Mitarbeiter:in hat Plan abgelehnt

source: # Worker review completed
de_de: # Beurteilung von Mitarbeiter:innen abgeschlossen

source: % Worker review completed
de_de: % Beurteilung von Mitarbeiter:innen abgeschlossen

source: Worker role
de_de: Rolle der Mitarbeiter:in

source: # Workers with RTI
de_de: # Mitarbeiter:innen mit RTI

source: % Workers with RTI
de_de: % Mitarbeiter:innen mit RTI

source: Worker Let's discuss submitted
de_de: Mitarbeiter:in „Lass uns darüber sprechen“ eingereicht

source: # Workers logged in
de_de: # Mitarbeiter:innen angemeldet

source: Workers overall behavior rating comment
de_de: Kommentar zur Gesamtbewertung des Verhaltens von Mitarbeiter:innen

source: Worker overall behavior rating scale
de_de: Skala für die Gesamtbewertung des Verhaltens von Mitarbeiter:innen

source: Worker overall goal rating comment
de_de: Kommentar zur Gesamtzielbewertung von Mitarbeiter:innen

source: Workers overall goal rating scale ID
de_de: ID der Gesamtzielbewertungsskala von Mitarbeiter:innen

source: Workflow status name
de_de: Name des Workflow-Status

source: Workflow step
de_de: Workflow-Schritt

source: Achievement summary
de_de: Zusammenfassung der Leistungen

source: Action
de_de: Aktion

source: Actions completed
de_de: Abgeschlossene Aktionen

source: Active users by role
de_de: Aktive Benutzer nach Rolle

source: Active users who sent feedback
de_de: Aktive Benutzer, die Feedback gesendet haben

source: # Active workers with RTI requests
de_de: # Aktive Mitarbeiter:innen mit RTI-Anfragen

source: % Active workers with RTI requests
de_de: % Aktive Mitarbeiter:innen mit RTI-Anfragen

source: Activity
de_de: Aktivität

source: Additional review questions
de_de: Zusätzliche Beurteilungsfragen

source: Adoption Monitor
de_de: Adoptionsmonitor

source: Adoption & Top-Level Summaries
de_de: Akzeptanz und übergeordnete Zusammenfassungen

source: % aligned goals
de_de: % ausgerichtete Ziele

source: Alignment - Self & manager
de_de: Abgleich – Selbst & Führungskraft

source: Assigned check-ins
de_de: Zugewiesene Check-ins

source: Average & max. total scores by org level
de_de: Durchschnittliche & maximale Gesamtwerte nach Organisationsebene

source: Average total score by org unit
de_de: Durchschnittlicher Gesamtwert nach Organisationseinheit

source: Average wait time for not released
de_de: Durchschnittliche Wartezeit für nicht veröffentlichte

source: Avg. check-ins (managers)
de_de: Durchschn. Check-ins (Führungskräfte)

source: Avg. check-ins (workers)
de_de: Durchschn. Check-ins (Mitarbeiter:innen)

source: Avg. current goal progress
de_de: Durchschn. aktueller Zielerreichungsgrad

source: Avg. logins over time
de_de: Durchschnittliche Logins im Zeitverlauf

source: Avg. parent goal progress
de_de: Durchschn. Zielerreichungsgrad übergeordneter Ziele

source: Avg. progress
de_de: Durchschn. Fortschritt

source: Behavior count distribution
de_de: Verteilung der Verhaltensanzahl

source: Behavior distribution
de_de: Verteilungsübersicht zu Verhaltensweisen

source: Behavior Overview
de_de: Verhaltensübersicht

source: Behaviors sent over time
de_de: Übermittelte Verhaltensweisen im Zeitverlauf

source: Behavior received
de_de: Erhaltenes Verhalten

source: Behavior requested
de_de: Angefordertes Verhalten

source: Behavior sent
de_de: Gesendetes Verhalten

source: Behaviors received
de_de: Erhaltene Verhaltensweisen

source: Bonus Allocation Overview
de_de: Übersicht der Bonuszuteilung

source: Bonus Comp Round Export Details
de_de: Exportdetails der Bonus-Vergütungsrunde

source: Career plan completion rate
de_de: Abschlussquote für Entwicklungspläne

source: Career Plan Overview
de_de: Übersicht Karriereplan

source: Career Plan Status
de_de: Status Karriereplan

source: Career plans by workflow status
de_de: Entwicklungspläne nach Workflow-Status

source: # Career plans pending manager completion
de_de: # Entwicklungspläne, die von Führungskräften noch abzuschließen sind

source: Career plan workflow status
de_de: Workflow-Status der Entwicklungspläne

source: Check-in Overview
de_de: Check-in-Übersicht

source: Check-in participant relation
de_de: Beziehung der Check-in-Teilnehmenden

source: Check-in status by org. level
de_de: Check-in-Status nach Organisationsebene

source: Check-ins having messages
de_de: Check-ins mit Nachrichten

source: Check-ins in the future
de_de: Check-ins in der Zukunft

source: Check-ins over time
de_de: Check-ins im Zeitverlauf

source: Check-ins recurring
de_de: Wiederkehrende Check-ins

source: Check-ins with discussion points
de_de: Check-ins mit Gesprächspunkten

source: Check-ins with message
de_de: Check-ins mit Nachricht

source: Check-ins with messages by role
de_de: Check-ins mit Nachrichten nach Rolle

source: Check-ins created over time
de_de: Im Zeitverlauf erstellte Check-ins

source: Clarity (avg.)
de_de: Klarheit (Durchschn.)

source: Clarity (distribution)
de_de: Klarheit (Verteilung)

source: Closed after deadline
de_de: Nach Fristablauf geschlossen

source: Closed before deadline
de_de: Vor Fristablauf geschlossen

source: Closed RTI request by deadline met
de_de: Geschlossene RTI-Anfrage mit eingehaltenem Termin

source: Closed RTI requests
de_de: Geschlossene RTI-Anfragen

source: # Closed RTI requests
de_de: # geschlossene RTI-Anfragen

source: Comm round details by worker
de_de: Details der Vergütungsrunde nach Mitarbeiter:in

source: Comm round document audit details
de_de: Details zur Dokumentenprüfung der Vergütungsrunde

source: Communication audit trail
de_de: Kommunikationsprüfpfad

source: Communication details
de_de: Kommunikationsdetails

source: Communication executive overview
de_de: Kommunikation – Managementübersicht

source: Communication over time
de_de: Kommunikation im Zeitverlauf

source: Communication round
de_de: Kommunikationsrunde

source: Communication status
de_de: Kommunikationsstatus

source: Comp Rounds
de_de: Vergütungsrunden

source: Performance Executive Summary
de_de: Zusammenfassung der Leistung

source: Cumulative first time login over time
de_de: Kumulierte erstmalige Logins im Zeitverlauf

source: Data Privacy acceptance
de_de: Einwilligung in den Datenschutz

source: Device usage
de_de: Gerätenutzung

source: Distribution of answers for multiple choice questions with drill-down
de_de: Verteilung der Antworten auf Multiple-Choice-Fragen mit Drill-down

source: Document action date
de_de: Datum der Dokumentaktion

source: Document creation by date
de_de: Dokumenterstellung nach Datum

source: Document not released
de_de: Dokument nicht freigegeben

source: Document release status
de_de: Status der Dokumentfreigabe

source: Document released
de_de: Dokument freigegeben

source: Documents read over time
de_de: Gelesene Dokumente im Zeitverlauf

source: Documents released over time
de_de: Freigegebene Dokumente im Zeitverlauf

source: Worker details
de_de: Mitarbeiter:innen-Details

source: Endorsed, public & shared
de_de: Bestätigt, öffentlich & geteilt

source: Evaluation scores by org level
de_de: Bewertungen nach Organisationsebene

source: Evaluation section by worker
de_de: Bewertungsabschnitt nach Mitarbeiter:in

source: Evaluation section name
de_de: Name des Bewertungsabschnitts

source: as *.{{format}}
de_de: als *.{{format}}

source: Export page
de_de: Seite exportieren

source: Your file is being generated. The download will begin automatically once it's ready. This window will close on its own after the download is complete.
de_de: Ihre Datei wird erstellt. Der Download startet automatisch, sobald sie bereit ist. Dieses Fenster schließt sich nach Abschluss des Downloads von selbst.

source: Preparing your download
de_de: Ihr Download wird vorbereitet

source: Export report
de_de: Bericht exportieren

source: Feedback characteristics
de_de: Feedbackmerkmale

source: Feedback flow
de_de: Feedbackablauf

source: Feedback Overview
de_de: Feedback-Übersicht

source: Feedback quality metrics
de_de: Kennzahlen zur Feedbackqualität

source: Feedback Ratings
de_de: Feedback-Bewertungen

source: Feedback received
de_de: Erhaltenes Feedback

source: Feedback received over time
de_de: Erhaltenes Feedback im Zeitverlauf

source: Feedback Request Overview
de_de: Übersicht Feedbackanfragen

source: Feedback sent
de_de: Feedback gesendet

source: Feedback sent by role
de_de: Gesendetes Feedback nach Rolle

source: Feedback sent by type
de_de: Gesendetes Feedback nach Typ

source: Feedback sent over time
de_de: Gesendetes Feedback im Zeitverlauf

source: Feedback with behaviors
de_de: Feedback mit Verhaltensbezug

source: Final manager/worker alignment
de_de: Abschließende Abstimmung zwischen Manager:in und Mitarbeiter:in

source: Final review rating distribution
de_de: Verteilung der endgültigen Beurteilungsbewertungen

source: First-time logins over time (cumulative)
de_de: Erstanmeldungen im Zeitverlauf (kumulativ)

source: Functionality usage
de_de: Funktionsnutzung

source: Goal Alignment
de_de: Zielausrichtung

source: Goal Details
de_de: Zieldetails

source: Goal Overview
de_de: Zielübersicht

source: Goal priority & tracking status
de_de: Zielpriorität und Nachverfolgungsstatus

source: Goal status by org. level
de_de: Zielstatus nach Organisationsebene

source: Goal Strategic Drivers
de_de: Strategische Zieltreiber

source: Goal title word cloud
de_de: Wordcloud zu Zieltiteln

source: Goals approved
de_de: Genehmigte Ziele

source: Goals completed
de_de: Abgeschlossene Ziele

source: Goals created over time
de_de: Erstellte Ziele im Zeitverlauf

source: Goal details
de_de: Details

source: Goal Status
de_de: Zielstatus

source: Goals with actions
de_de: Ziele mit Maßnahmen

source: Individual People Day Summary
de_de: Tagesübersicht für einzelne Personen

source: Initial manager/worker alignment
de_de: Erstmalige Abstimmung zwischen Manager:in und Mitarbeiter:in

source: The innermost circle represents the line leader rating submitted pre-People Day, followed by he line leader rating post People Day, followed by the line leader rating post Let's Discuss. The outermost circle represent line leader +1 rating during the post Challenge process.
de_de: Der innerste Kreis stellt die von der Führungskraft vor dem People Day abgegebene Bewertung dar, gefolgt von der Bewertung der Führungskraft nach dem People Day und anschließend der Bewertung der Führungskraft nach „Let’s Discuss“. Der äußerste Kreis stellt die Bewertung der Führungskraft + 1 während des Prozesses nach „Challenge“ dar.

source: Last data refresh
de_de: Letzte Datenaktualisierung

source: Leadership clusters
de_de: Führungskräfte-Cluster

source: Let's discuss between manager & worker
de_de: Lassen Sie uns zwischen Führungskraft und Mitarbeiter:in besprechen

source: Logins over time
de_de: Anmeldungen im Zeitverlauf

source: Logins per platform
de_de: Logins pro Plattform

source: Manager + 1 review challenge
de_de: Challenge für Beurteilung von Führungskraft + 1

source: # Manager completions over time
de_de: # Managerabschlüsse im Zeitverlauf

source: Manager having to complete career plans
de_de: Manager mit zu vervollständigenden Karriereplänen

source: Manager rating distribution
de_de: Verteilung der Bewertungen durch Führungskräfte

source: Manager review behavior distribution
de_de: Verteilung des Manager-Beurteilungsverhaltens

source: Manager review change (people day)
de_de: Änderung der Beurteilung durch Führungskraft (People Day)

source: Manager review goal distribution
de_de: Verteilung der Manager-Beurteilungsziele

source: Managers having goals
de_de: Manager mit Zielen

source: Managers with no goals
de_de: Manager ohne Ziele

source: New logins over time
de_de: Neue Logins im Zeitverlauf

source: # New RTI requests
de_de: Anzahl neuer RTI-Anträge

source: No goals (all users)
de_de: Keine Ziele (alle Benutzer)

source: No Goals Detail
de_de: Keine Zieldetails

source: Number of reviews with evaluation section score = 0
de_de: Anzahl der Beurteilungen mit Bewertungsabschnittsnote = 0

source: Open right to information (RTI) requests
de_de: Offene Anträge auf Informationszugang (RTI)

source: Open RTI request by deadline status
de_de: Offene RTI-Anträge nach Fristenstatus

source: # Open RTI requests by country
de_de: Anzahl offener RTI-Anträge nach Land

source: # Open RTI requests by org unit
de_de: Anzahl offener RTI-Anträge nach Organisationseinheit

source: # Open RTI requests
de_de: Anzahl offener RTI-Anträge

source: Org. goals
de_de: Organisationsziele

source: The outer circle represents post People Day manager rating (prior to People Day this will reflect the last submitted rating). The inner circle represents manager rating submitted pre-People Day
de_de: Der äußere Kreis stellt die Managerbewertung nach dem People Day dar (vor dem People Day zeigt dieser die zuletzt abgegebene Bewertung an). Der innere Kreis stellt die Managerbewertung dar, die vor dem People Day abgegeben wurde.

source: Outlook
de_de: Ausblick

source: Overview
de_de: Übersicht

source: Pay Communication
de_de: Vergütungskommunikation

source: Pay & Performance
de_de: Vergütung und Leistung

source: Pay Transparency - Right to Information
de_de: Gehaltstransparenz – Auskunftsrecht

source: Percent of total
de_de: Prozentsatz des Gesamtwerts

source: Performance Check-in Overview
de_de: Übersicht Performance-Check-ins

source: Performance check-in rating by org levels
de_de: Performance-Check-in-Bewertung nach Organisationsebenen

source: Performance check-in status by org level
de_de: Status der Performance-Check-ins nach Organisationsebene

source: Performance Reviews
de_de: Leistungsbeurteilungen

source: Performance Reviews - Goals & Behaviors
de_de: Leistungsbeurteilungen – Ziele und Verhalten

source: Process Status Report
de_de: Prozessstatusbericht

source: Question type usage
de_de: Nutzung nach Fragetyp

source: Questions
de_de: Fragen

source: Questions & Answers
de_de: Fragen & Antworten

source: Rating alignment
de_de: Abstimmung der Bewertungen

source: Rating changed by manager
de_de: Bewertung geändert durch Führungskraft

source: Rating changed by moderator
de_de: Bewertung geändert durch Moderator:in

source: Rating changed manager
de_de: Bewertung geändert Führungskraft

source: Rating distribution
de_de: Bewertungsverteilung

source: Read & release status by org level
de_de: Lese- und Freigabestatus nach Organisationsebene

source: Read status
de_de: Dokumentstatus

source: Read status by comm round (released documents)
de_de: Lesestatus nach Vergütungsrunde (freigegebene Dokumente)

source: Read status by org level (released documents)
de_de: Lesestatus nach Organisationsebene (freigegebene Dokumente)

source: Read status (unreleased documents)
de_de: Lesestatus (nicht freigegebene Dokumente)

source: # Refused career plan
de_de: # Abgelehnter Karriereplan

source: Release status by comm round
de_de: Freigabestatus nach Vergütungsrunde

source: Release status by org level
de_de: Freigabestatus nach Organisationsebene

source: Reply rate
de_de: Antwortquote

source: Request Flow
de_de: Antragsablauf

source: Requests read
de_de: Gelesene Anfragen

source: Requests sent over time
de_de: Gesendete Anfragen im Zeitverlauf

source: Requests with behaviors
de_de: Anfragen mit Verhaltensbezug

source: Review
de_de: Beurteilung

source: Review additional questions
de_de: Zusätzliche Fragen zur Beurteilung

source: Review Behaviors Details
de_de: Details zum Beurteilungsverhalten

source: Review challenge
de_de: Herausforderung der Beurteilung

source: Review completion
de_de: Abschluss der Beurteilung

source: Review Details
de_de: Beurteilungsdetails

source: Review Details & Additional Questions
de_de: Beurteilungsdetails & zusätzliche Fragen

source: Review Distribution Overview
de_de: Übersicht Bewertungsverteilung

source: Review evaluation table
de_de: Beurteilungsauswertungstabelle

source: Review Executive Summary
de_de: Beurteilungsmanagement Summary

source: Review Goals & Behaviors Overview
de_de: Übersicht über Ziele und Verhalten in Beurteilungen
